{
  "1": "Base UI: AccordionItemContext is missing. Accordion parts must be placed within <Accordion.Item>.",
  "2": "Base UI: AccordionRootContext is missing. Accordion parts must be placed within <Accordion.Root>.",
  "3": "Base UI: <AlertDialog.Portal> is missing.",
  "4": "Base UI: AlertDialogRootContext is missing. AlertDialog parts must be placed within <AlertDialog.Root>.",
  "5": "Base UI: AvatarRootContext is missing. Avatar parts must be placed within <Avatar.Root>.",
  "6": "Base UI: CheckboxRootContext is missing. Checkbox parts must be placed within <Checkbox.Root>.",
  "7": "Base UI: CheckboxGroupContext is missing. CheckboxGroup parts must be placed within <CheckboxGroup>.",
  "8": "Base UI: CollapsibleRootContext is missing. Collapsible parts must be placed within <Collapsible.Root>.",
  "9": "Base UI: CompositeRootContext is missing. Composite parts must be placed within <Composite.Root>.",
  "10": "Base UI: ContextMenuRootContext is missing. ContextMenu parts must be placed within <ContextMenu.Root>.",
  "11": "Base UI: <Dialog.Portal> is missing.",
  "12": "Base UI: DialogRootContext is missing. Dialog parts must be placed within <Dialog.Root>.",
  "13": "Base UI: DirectionContext is missing.",
  "14": "Base UI: FieldRootContext is missing. Field parts must be placed within <Field.Root>.",
  "15": "Base UI: MenuCheckboxItemContext is missing. MenuCheckboxItem parts must be placed within <Menu.CheckboxItem>.",
  "16": "Base UI: Missing MenuGroupRootContext provider",
  "17": "Base UI: <Menu.Portal> is missing.",
  "18": "Base UI: MenuPositionerContext is missing. MenuPositioner parts must be placed within <Menu.Positioner>.",
  "19": "Base UI: MenuRadioGroupContext is missing. MenuRadioGroup parts must be placed within <Menu.RadioGroup>.",
  "20": "Base UI: MenuRadioItemContext is missing. MenuRadioItem parts must be placed within <Menu.RadioItem>.",
  "21": "Base UI: MenuRootContext is missing. Menu parts must be placed within <Menu.Root>.",
  "22": "Base UI: SubmenuTrigger must be placed in a nested Menu.",
  "23": "Base UI: MenubarContext is missing. Menubar parts must be placed within <Menubar>.",
  "24": "Base UI: MeterRootContext is missing. Meter parts must be placed within <Meter.Root>.",
  "25": "Base UI: NavigationMenuItem parts must be used within a <NavigationMenu.Item>.",
  "26": "Base UI: <NavigationMenu.Portal> is missing.",
  "27": "Base UI: NavigationMenuPositionerContext is missing. NavigationMenuPositioner parts must be placed within <NavigationMenu.Positioner>.",
  "28": "Base UI: NavigationMenuRootContext is missing. Navigation Menu parts must be placed within <NavigationMenu.Root>.",
  "29": "Base UI: NumberFieldRootContext is missing. NumberField parts must be placed within <NumberField.Root>.",
  "30": "Base UI: NumberFieldScrubAreaContext is missing. NumberFieldScrubArea parts must be placed within <NumberField.ScrubArea>.",
  "31": "Base UI: <Popover.Portal> is missing.",
  "32": "Base UI: PopoverPositionerContext is missing. PopoverPositioner parts must be placed within <Popover.Positioner>.",
  "33": "Base UI: PopoverRootContext is missing. Popover parts must be placed within <Popover.Root>.",
  "34": "Base UI: <PreviewCard.Portal> is missing.",
  "35": "Base UI: <PreviewCard.Popup> and <PreviewCard.Arrow> must be used within the <PreviewCard.Positioner> component",
  "36": "Base UI: PreviewCardRootContext is missing. PreviewCard parts must be placed within <PreviewCard.Root>.",
  "37": "Base UI: ProgressRootContext is missing. Progress parts must be placed within <Progress.Root>.",
  "38": "Base UI: RadioRootContext is missing. Radio parts must be placed within <Radio.Root>.",
  "39": "Base UI: ScrollAreaRootContext is missing. ScrollArea parts must be placed within <ScrollArea.Root>.",
  "40": "Base UI: ScrollAreaScrollbarContext is missing. ScrollAreaScrollbar parts must be placed within <ScrollArea.Scrollbar>.",
  "41": "Base UI: ScrollAreaViewportContext missing. ScrollAreaViewport parts must be placed within <ScrollArea.Viewport>.",
  "42": "Base UI: SelectGroupContext is missing. SelectGroup parts must be placed within <Select.Group>.",
  "43": "Base UI: SelectItemContext is missing. SelectItem parts must be placed within <Select.Item>.",
  "44": "Base UI: <Select.Portal> is missing.",
  "45": "Base UI: SelectPositionerContext is missing. SelectPositioner parts must be placed within <Select.Positioner>.",
  "46": "Base UI: SelectIndexContext is missing. Select parts must be placed within <Select.Root>.",
  "47": "useSelectRootContext must be used within a SelectRoot",
  "48": "Base UI: SliderRootContext is missing. Slider parts must be placed within <Slider.Root>.",
  "49": "Base UI: SwitchRootContext is missing. Switch parts must be placed within <Switch.Root>.",
  "50": "Base UI: TabsListContext is missing. TabsList parts must be placed within <Tabs.List>.",
  "51": "Base UI: TabsRootContext is missing. Tabs parts must be placed within <Tabs.Root>.",
  "52": "Base UI: useToast must be used within <Toast.Provider>.",
  "53": "useToastRoot must be used within a ToastRoot",
  "54": "Base UI: ToastViewportContext is missing. Toast parts must be placed within <Toast.Viewport>.",
  "55": "Base UI: ToggleGroupContext is missing. ToggleGroup parts must be placed within <ToggleGroup>.",
  "56": "Base UI: ToolbarGroupContext is missing. ToolbarGroup parts must be placed within <Toolbar.Group>.",
  "57": "Base UI: ToolbarRootContext is missing. Toolbar parts must be placed within <Toolbar.Root>.",
  "58": "Base UI: <Tooltip.Portal> is missing.",
  "59": "Base UI: TooltipPositionerContext is missing. TooltipPositioner parts must be placed within <Tooltip.Positioner>.",
  "60": "Base UI: TooltipRootContext is missing. Tooltip parts must be placed within <Tooltip.Root>.",
  "61": "Cannot call an event handler while rendering.",
  "62": "Need either element or render to be defined"
}
