{
  "1": "Unsupported number of selectors",
  "2": "Unsupported number of arguments",
  "3": "Base UI: CheckboxGroupContext is missing. CheckboxGroup parts must be placed within <CheckboxGroup>.",
  "4": "Base UI: DirectionContext is missing.",
  "5": "Base UI: MenubarContext is missing. Menubar parts must be placed within <Menubar>.",
  "7": "Base UI: ToggleGroupContext is missing. ToggleGroup parts must be placed within <ToggleGroup>.",
  "8": "Base UI: Render element or function are not defined.",
  "9": "Base UI: AccordionItemContext is missing. Accordion parts must be placed within <Accordion.Item>.",
  "10": "Base UI: AccordionRootContext is missing. Accordion parts must be placed within <Accordion.Root>.",
  "11": "Base UI: <AlertDialog.Portal> is missing.",
  "12": "Base UI: AlertDialogRootContext is missing. AlertDialog parts must be placed within <AlertDialog.Root>.",
  "13": "Base UI: AvatarRootContext is missing. Avatar parts must be placed within <Avatar.Root>.",
  "14": "Base UI: CheckboxRootContext is missing. Checkbox parts must be placed within <Checkbox.Root>.",
  "15": "Base UI: CollapsibleRootContext is missing. Collapsible parts must be placed within <Collapsible.Root>.",
  "16": "Base UI: CompositeRootContext is missing. Composite parts must be placed within <Composite.Root>.",
  "17": "useComboboxChipContext must be used within a ComboboxChip",
  "18": "Base UI: ComboboxGroupContext is missing. ComboboxGroup parts must be placed within <Combobox.Group>.",
  "19": "Base UI: ComboboxItemContext is missing. ComboboxItem parts must be placed within <Combobox.Item>.",
  "20": "Base UI: <Combobox.Portal> is missing.",
  "21": "Base UI: <Combobox.Popup> and <Combobox.Arrow> must be used within the <Combobox.Positioner> component",
  "22": "Base UI: ComboboxRootContext is missing. Combobox parts must be placed within <Combobox.Root>.",
  "23": "Base UI: ComboboxFloatingContext is missing. Combobox parts must be placed within <Combobox.Root>.",
  "24": "Base UI: ComboboxItemsContext is missing. Combobox parts must be placed within <Combobox.Root>.",
  "25": "Base UI: ContextMenuRootContext is missing. ContextMenu parts must be placed within <ContextMenu.Root>.",
  "26": "Base UI: <Dialog.Portal> is missing.",
  "27": "Base UI: DialogRootContext is missing. Dialog parts must be placed within <Dialog.Root>.",
  "28": "Base UI: FieldRootContext is missing. Field parts must be placed within <Field.Root>.",
  "29": "[Floating UI]: Invalid grid - item width at index %s is greater than grid columns",
  "30": "Base UI: MenuCheckboxItemContext is missing. MenuCheckboxItem parts must be placed within <Menu.CheckboxItem>.",
  "31": "Base UI: MenuGroupRootContext is missing. Menu group parts must be used within <Menu.Group>.",
  "32": "Base UI: <Menu.Portal> is missing.",
  "33": "Base UI: MenuPositionerContext is missing. MenuPositioner parts must be placed within <Menu.Positioner>.",
  "34": "Base UI: MenuRadioGroupContext is missing. MenuRadioGroup parts must be placed within <Menu.RadioGroup>.",
  "35": "Base UI: MenuRadioItemContext is missing. MenuRadioItem parts must be placed within <Menu.RadioItem>.",
  "36": "Base UI: MenuRootContext is missing. Menu parts must be placed within <Menu.Root>.",
  "37": "Base UI: <Menu.SubmenuTrigger> must be placed in <Menu.SubmenuRoot>.",
  "38": "Base UI: MeterRootContext is missing. Meter parts must be placed within <Meter.Root>.",
  "39": "Base UI: NavigationMenuItem parts must be used within a <NavigationMenu.Item>.",
  "40": "Base UI: <NavigationMenu.Portal> is missing.",
  "41": "Base UI: NavigationMenuRootContext is missing. Navigation Menu parts must be placed within <NavigationMenu.Root>.",
  "42": "Base UI: NavigationMenuPositionerContext is missing. NavigationMenuPositioner parts must be placed within <NavigationMenu.Positioner>.",
  "43": "Base UI: NumberFieldRootContext is missing. NumberField parts must be placed within <NumberField.Root>.",
  "44": "Base UI: NumberFieldScrubAreaContext is missing. NumberFieldScrubArea parts must be placed within <NumberField.ScrubArea>.",
  "45": "Base UI: <Popover.Portal> is missing.",
  "46": "Base UI: PopoverPositionerContext is missing. PopoverPositioner parts must be placed within <Popover.Positioner>.",
  "47": "Base UI: PopoverRootContext is missing. Popover parts must be placed within <Popover.Root>.",
  "48": "Base UI: <PreviewCard.Portal> is missing.",
  "49": "Base UI: <PreviewCard.Popup> and <PreviewCard.Arrow> must be used within the <PreviewCard.Positioner> component",
  "50": "Base UI: PreviewCardRootContext is missing. PreviewCard parts must be placed within <PreviewCard.Root>.",
  "51": "Base UI: ProgressRootContext is missing. Progress parts must be placed within <Progress.Root>.",
  "52": "Base UI: RadioRootContext is missing. Radio parts must be placed within <Radio.Root>.",
  "53": "Base UI: ScrollAreaRootContext is missing. ScrollArea parts must be placed within <ScrollArea.Root>.",
  "54": "Base UI: ScrollAreaScrollbarContext is missing. ScrollAreaScrollbar parts must be placed within <ScrollArea.Scrollbar>.",
  "55": "Base UI: ScrollAreaViewportContext missing. ScrollAreaViewport parts must be placed within <ScrollArea.Viewport>.",
  "56": "Base UI: SelectGroupContext is missing. SelectGroup parts must be placed within <Select.Group>.",
  "57": "Base UI: SelectItemContext is missing. SelectItem parts must be placed within <Select.Item>.",
  "58": "Base UI: <Select.Portal> is missing.",
  "59": "Base UI: SelectPositionerContext is missing. SelectPositioner parts must be placed within <Select.Positioner>.",
  "60": "Base UI: SelectRootContext is missing. Select parts must be placed within <Select.Root>.",
  "61": "Base UI: SelectFloatingContext is missing. Select parts must be placed within <Select.Root>.",
  "62": "Base UI: SliderRootContext is missing. Slider parts must be placed within <Slider.Root>.",
  "63": "Base UI: SwitchRootContext is missing. Switch parts must be placed within <Switch.Root>.",
  "64": "Base UI: TabsRootContext is missing. Tabs parts must be placed within <Tabs.Root>.",
  "65": "Base UI: TabsListContext is missing. TabsList parts must be placed within <Tabs.List>.",
  "66": "Base UI: ToastRootContext is missing. Toast parts must be used within <Toast.Root>.",
  "67": "Base UI: ToastViewportContext is missing. Toast parts must be placed within <Toast.Viewport>.",
  "68": "Base UI: ToolbarGroupContext is missing. ToolbarGroup parts must be placed within <Toolbar.Group>.",
  "69": "Base UI: ToolbarRootContext is missing. Toolbar parts must be placed within <Toolbar.Root>.",
  "70": "Base UI: <Tooltip.Portal> is missing.",
  "71": "Base UI: TooltipPositionerContext is missing. TooltipPositioner parts must be placed within <Tooltip.Positioner>.",
  "72": "Base UI: TooltipRootContext is missing. Tooltip parts must be placed within <Tooltip.Root>.",
  "73": "Base UI: useToastManager must be used within <Toast.Provider>.",
  "74": "Base UI: <Popover.Trigger> must be either used within a <Popover.Root> component or provided with a handle.",
  "75": "Base UI: PopoverTrigger must have an `id` prop specified.",
  "76": "Base UI: selectors are required to call useState.",
  "77": "Base UI: Trigger must have an `id` prop specified.",
  "78": "Base UI: <AlertDialog.Trigger> must be used within <AlertDialog.Root> or provided with a handle.",
  "79": "Base UI: <Dialog.Trigger> must be used within <Dialog.Root> or provided with a handle.",
  "80": "Base UI: PopoverHandle.open: No trigger found with id \"%s\".",
  "81": "Base UI: TooltipHandle.open: No trigger found with id \"%s\".",
  "82": "Base UI: <Tooltip.Trigger> must be either used within a <Tooltip.Root> component or provided with a handle.",
  "83": "Base UI: MenuHandle.open: No trigger found with id \"%s\".",
  "84": "Base UI: ToastPositionerContext is missing. ToastPositioner parts must be placed within <Toast.Positioner>.",
  "85": "Base UI: <Menu.Trigger> must be either used within a <Menu.Root> component or provided with a handle.",
  "86": "Base UI: FieldsetRootContext is missing. Fieldset parts must be placed within <Fieldset.Root>.",
  "87": "Base UI: A trigger element cannot be registered under multiple IDs in PopupTriggerMap.",
  "88": "Base UI: PreviewCardHandle.open: No trigger found with id \"%s\".",
  "89": "Base UI: <PreviewCard.Trigger> must be either used within a <PreviewCard.Root> component or provided with a handle.",
  "90": "Base UI: DrawerRootContext is missing. Drawer parts must be placed within <Drawer.Root>.",
  "91": "Base UI: DrawerProviderContext is missing. Use <Drawer.Provider>.",
  "92": "Base UI: DrawerViewportContext is missing. Drawer parts must be placed within <Drawer.Viewport>.",
  "93": "Base UI: TemporalAdapterContext is missing. Temporal components must be place within <TemporalAdapterProvider />",
  "94": "Base UI: LocalizationContext is missing. Temporal components must be place within <LocalizationProvider />",
  "95": "Base UI: SharedCalendarDayGridBodyContext is missing. <Calendar.DayGridRow /> must be placed within <Calendar.DayGridBody /> and <RangeCalendar.DayGridRow /> must be placed within <RangeCalendar.DayGridBody />.",
  "96": "Base UI: SharedCalendarDayGridCellContext is missing. <Calendar.DayButton /> must be placed within <Calendar.DayGridCell /> and <RangeCalendar.DayButton /> must be placed within <RangeCalendar.DayGridCell />.",
  "97": "Base UI: SharedCalendarRootContext is missing. Calendar parts must be placed within <Calendar.Root /> and Range Calendar parts must be placed within <RangeCalendar.Root />."
}
