{
  "componentDescription": "Renders the element that positions the Menu popup.",
  "propDescriptions": {
    "align": {
      "description": "The align of the Menu element to the anchor element along its cross axis."
    },
    "alignOffset": { "description": "The offset of the Menu element along its align axis." },
    "anchor": { "description": "The anchor element to which the Menu popup will be placed at." },
    "arrowPadding": {
      "description": "Determines the padding between the arrow and the Menu popup&#39;s edges. Useful when the popover popup has rounded corners via <code>border-radius</code>."
    },
    "className": {
      "description": "Class names applied to the element or a function that returns them based on the component&#39;s state."
    },
    "collisionBoundary": {
      "description": "The boundary that the Menu element should be constrained to."
    },
    "collisionPadding": { "description": "The padding of the collision boundary." },
    "container": {
      "description": "The container element to which the Menu popup will be appended to."
    },
    "hideWhenDetached": {
      "description": "If <code>true</code>, the Menu will be hidden if it is detached from its anchor element due to differing clipping contexts."
    },
    "keepMounted": {
      "description": "Whether the menu popup remains mounted in the DOM while closed."
    },
    "positionMethod": {
      "description": "The CSS position strategy for positioning the Menu popup element."
    },
    "render": { "description": "A function to customize rendering of the component." },
    "side": {
      "description": "The side of the anchor element that the Menu element should align to."
    },
    "sideOffset": { "description": "The gap between the anchor element and the Menu element." },
    "sticky": {
      "description": "If <code>true</code>, allow the Menu to remain in stuck view while the anchor element is scrolled out of view."
    }
  },
  "classDescriptions": {},
  "cssVariablesDescriptions": {
    "--anchor-height": "The anchor&#39;s height.",
    "--anchor-width": "The anchor&#39;s width.",
    "--available-height": "The available height between the trigger and the edge of the viewport.",
    "--available-width": "The available width between the trigger and the edge of the viewport.",
    "--transform-origin": "The coordinates that this element is anchored to. Used for animations and transitions."
  }
}
