{
  "componentDescription": "",
  "propDescriptions": {
    "aria-label": { "description": "The label for the Indicator component." },
    "aria-labelledby": {
      "description": "An id or space-separated list of ids of elements that label the Indicator component."
    },
    "aria-valuetext": {
      "description": "A string value that provides a human-readable text alternative for the current value of the meter indicator."
    },
    "className": {
      "description": "Class names applied to the element or a function that returns them based on the component&#39;s state."
    },
    "direction": { "description": "The direction that the meter fills towards" },
    "getAriaLabel": {
      "description": "Accepts a function which returns a string value that provides an accessible name for the Indicator component",
      "typeDescriptions": { "value": "The component&#39;s value" }
    },
    "getAriaValueText": {
      "description": "Accepts a function which returns a string value that provides a human-readable text alternative for the current value of the meter indicator.",
      "typeDescriptions": { "value": "The component&#39;s value to format" }
    },
    "high": {
      "description": "Sets the lower boundary of the high end of the numeric range represented by the component. If unspecified, or greater than <code>max</code>, it will fall back to <code>max</code>."
    },
    "low": {
      "description": "Sets the upper boundary of the low end of the numeric range represented by the component. If unspecified, or less than <code>min</code>, it will fall back to <code>min</code>."
    },
    "max": { "description": "The maximum value" },
    "min": { "description": "The minimum value" },
    "optimum": {
      "description": "Indicates the optimal point in the numeric range represented by the component. If unspecified, it will fall back to the midpoint between <code>min</code> and <code>max</code>."
    },
    "render": { "description": "A function to customize rendering of the component." },
    "value": { "description": "The current value." }
  },
  "classDescriptions": {}
}
