{
  "componentDescription": "The foundation for building custom-styled number fields.",
  "propDescriptions": {
    "allowWheelScrub": {
      "description": "Whether to allow the user to scrub the input value with the mouse wheel while focused and hovering over the input."
    },
    "className": {
      "description": "Class names applied to the element or a function that returns them based on the component&#39;s state."
    },
    "disabled": { "description": "If <code>true</code>, the input element is disabled." },
    "id": { "description": "The id of the input element." },
    "invalid": { "description": "If <code>true</code>, the input element is invalid." },
    "largeStep": {
      "description": "The large step value of the input element when incrementing while the shift key is held. Snaps to multiples of this value."
    },
    "max": { "description": "The maximum value of the input element." },
    "min": { "description": "The minimum value of the input element." },
    "name": { "description": "The name of the input element." },
    "onChange": {
      "description": "Callback fired when the number value changes.",
      "typeDescriptions": { "value": "The new value." }
    },
    "readOnly": { "description": "If <code>true</code>, the input element is read only." },
    "render": { "description": "A function to customize rendering of the component." },
    "required": { "description": "If <code>true</code>, the input element is required." },
    "smallStep": {
      "description": "The small step value of the input element when incrementing while the meta key is held. Snaps to multiples of this value."
    },
    "step": {
      "description": "The step value of the input element when incrementing, decrementing, or scrubbing. It will snap to multiples of this value. When unspecified, decimal values are allowed, but the stepper buttons will increment or decrement by <code>1</code>."
    },
    "value": { "description": "The raw number value of the input element." }
  },
  "classDescriptions": {}
}
